# Jogo a Ilha do tesouro

# Apresentação do jogo
print('''
======================== BEM VINDO À ILHA DO TESOURO! =========================
============= SUA MISSÃO É ENCONTRAR O TESOURO ESCONDIDO NA ILHA. =============
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."-` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/______/_
*******************************************************************************
''')

# Início do jogo
# Primeira escolha
print("*"*79)
choice1 = input('\nVocê está em uma encruzilhada. Para onde você quer ir? Digite "esquerda" ou "direita": ').lower()

if choice1 == "esquerda":
    # Segunda escolha
    print("*"*79)
    choice2 = input('\nVocê chegou a um lago. Há uma ilha no meio do lago. Digite "esperar" para esperar por um barco ou "nadar" para nadar até a ilha: ').lower()
    if choice2 == "esperar":
        # Terceira escolha
        print("*"*79)
        choice3 = input('\nVocê chegou à ilha ileso. Há uma casa com 3 portas: uma vermelha, uma amarela e uma azul. Qual cor você escolhe? ').lower()
        if choice3 == "amarela":
            print('''
                💎💎VOCÊ ECONTROU O TESOURO! PARABÉNS!💎💎
                ___________.=""_;=.______________|__________
                    |  ,-"_,=""     `"=.|                  |
                ____|__"=._o`"-._        `"=.______________|
                          `"=._o`"=._      _`"=._           
                _______________:=._o "=._."_.-="'"=.________
                    |    __.--" , ; `"=._o." ,-"""-._ ".   |
                ____|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|
                    |o`"=._` , "` `; .". ,  "-._"-._; ;     
                ____| ;`-.o`"=._; ." ` '`."-` . "-._ /______
                    | |o;    `"-.o`"=._``  '` " ,__.--o;   |
                ____|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|
                __/___|o;._    "      `".o|o_.--"    ;o;____
                ______/_"=._o--._        ; | ;        ; ;/__
                ___/______/__"=._o--._   ;o|o;     _._;o;___
                ______/______/____"=._o._; | ;_.--"o.--"_/__
                ___/______/______/_____"=.o|o_.--""___/______
                ''')
        elif choice3 == "vermelha":
            print('''
                  Você entrou em uma sala cheia de fogo 🥵!
                                GAME OVER
                  ''')
        elif choice3 == "azul":
            print('''
                  Você entrou em uma sala cheia de monstros 👹!
                                GAME OVER
                  ''')
        else:
            print('''
                  Você escolheu uma porta que não existe 😱!
                                GAME OVER
                  ''')
    else:
        print('''
              Você foi atacado por um peixe gigante 🦈!
                          GAME OVER
              ''')
else:
    print('''
          Você caiu em um buraco 🌌! 
                GAME OVER''')